namespace Logs
{
    internal class Program
    {
        static void Main(string[] args)
        {
            // דוגמת שימוש סעיף א
            SectionA.ProcessLogFile("C:\\Users\\1\\Desktop\\תוכנית הדסים\\תרגיל בית\\חלק א\\Logs\\Logs\\data\\logs.txt", 3);

        }
    }
}

/*
 5. ניתוח סיבוכיות זמן ומקום
זמן :
מעבר על כל השורות בקובץ - M
ספירת שכיחות שגיאות בכל חלק - M
מיזוג מילוני שכיחויות שגיאות - כמות שגיאות ייחודיות כפול כמות חלקים - E * A
מציאת שגיאות הכי שכיחות דורשת מיון מילון שכיחויות שגיאות - ELOGE

סך הכל זמן ריצה הוא 
O(M) + O(EA) + O(ELOGE)

מקום:
הקובץ המקורי - M
פיצול לתתי קבצים - M 
ספירת שכיחויות שגיאות בכל חלק - E
מיזוג מילוני שכיחויות  - E*A
מציאת שגיאות שכיחות ביותר - N

סך הכל המקום הוא 
 O(M) + O(EA)
 */